tutorials/IsoThermalNH3Decomposition/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8.x
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3100;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3120;
    }
    heatedWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       3140;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       3220;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1600;
        startFace       3220;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1600;
        startFace       4820;
    }
)

// ************************************************************************* //
