tutorials/IsoThermalNH3Decomposition/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Reference:
    Bui-Pham, M. N. (1992).
    Studies in structures of lam inar hydrocarbon flames.
    PhD Thesis, University of California, San Diego

Notes:
    This mechanism was developed for simulating this exact counter-flow flame
    configuration. It should not be considered general-purpose.

\*---------------------------------------------------------------------------*/

elements
3
(
H
O
N
NI
)
;

reactions
{
    /*
    un-named-reaction-0
    {
        type            irreversibleArrhenius;
        reaction        "N2 = N2";
        A               1;
        beta            0;
        Ta              5032.195335;
    }
    */

}
Tlow            0;
Thigh           4.503599627e+15;


// ************************************************************************* //
